WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  //------------------------------------------------------
  // Stream Half Transfer flag
  if((status & DMA_STREAM_HTIF_BIT) != 0)
  {
    // syslog cannot keep up with these strings 
    // syslog(1, "DMA ISR reason:Half Transfer\n");
  }

  //------------------------------------------------------
  // Stream Transfer Complete flag
  if((status & DMA_STREAM_TCIF_BIT) != 0)
  {
    // syslog(1, ">>>>> DMA ISR:Transfer complete\n");

#if ADC_TESTS_DO_ONE_CONVERSION_AT_A_TIME > 0
    // Now DMA2's SxCR register will need to be reset, as it's cleared
    // whenever an a DMA transfer has been completed.
    regval  = getreg32(STM32_DMA2_S0CR);
    regval |= DMA_SCR_EN;
    putreg32(regval, STM32_DMA2_S0CR);

    // Wakeup callers thread
    sem_post(&_waitTillDoneSem);
#endif
  }

  //---------------------------------------------------
  // Invalidate the cache
  // up_invalidate_dcache((uintptr_t)_dmaDataBuffer1,
  //               (uintptr_t)_dmaDataBuffer1 + (_gpioTransferCount * 2));

  // Do work here

  // Restart conversion

  // // Without SCAN mode (ADC_CR1_SCAN) this will restart the conversion
  // // Per Ref Man 15.8.2 this may need to be here
  // regval  = getreg32(baseADCAddr + STM32_ADC_CR2_OFFSET);
  // regval |= ADC_CR2_SWSTART;
  // putreg32(regval, baseADCAddr + STM32_ADC_CR2_OFFSET);

  // From Ref Man
  // At the end of the last DMA transfer (number of transfers configured in the
  // DMA controller’s DMA_SxNTR register):
  // • No new DMA request is issued to the DMA controller if the DDS bit is
  // cleared to 0 in the ADC_CR2 register (this avoids generating an overrun
  // error). However the DMA bit is not cleared by hardware. It must be written
  // to 0, then to 1 to start a new transfer.
  // • Requests can continue to be generated if the DDS bit is set to 1. This
  // allows configuring the DMA in double-buffer circular mode.

  // regval = getreg32(baseADCAddr + STM32_ADC_CR2_OFFSET);
  // regval &= ~ADC_CR2_DMA;
  // putreg32(regval, baseADCAddr + STM32_ADC_CR2_OFFSET);

  // regval |= ADC_CR2_DMA;
  // putreg32(regval, baseADCAddr + STM32_ADC_CR2_OFFSET);
}
#endif

//==========================================================================
// ADC conversion ISR
static int adc_conversion_interrupt_handler_isr(int irq, FAR void *context,
            FAR void *arg)
{
  // The interrupt conversion can be programmed to be called for the following
  // Discription                          Event Flag    Enable control bit
  // -----------                          ----------    ------------------
  // End of conversion of a regular group     EOC             EOCIE
  // End of conversion of an injected group   JEOC            JEOCIE
  // Analog watchdog status bit is set        AWD             AWDIE
  // Overrun                                  OVR             OVRIE
  uint32_t pendingInterrupts;
  uint32_t baseADCAddr = (uint32_t)arg;

  DEBUG_SET_HIGH(DEBUG_PIN_V2_D04);

  pendingInterrupts = getreg32(baseADCAddr + STM32_ADC_SR_OFFSET);
  if(pendingInterrupts == 0)
  {
    syslog(1, "-- ADC ISR-NO Interrupts --\n");
    return OK;
  }

  if ((pendingInterrupts & ADC_SR_AWD) != 0)
  {
    syslog(1, "-- ADC ISR-WatchDog --\n");
  }

  if ((pendingInterrupts & ADC_SR_OVR) != 0)
  {
    syslog(1, "-- ADC ISR-Over Run --\n");

#if ADC_TESTS_USE_DMA_TRANSFER > 0
    // From Ref Man 15.8.1 & 15.8.2
    // To recover the ADC from OVR when the DMA is used, follow the steps below:
    // 1. Reinitialize the DMA (adjust destination address and NDTR counter)
    // 2. Clear the ADC OVR bit in ADC_SR register (below)
    // 3. Trigger the ADC to start the conversion (below)
    //
    // (--) #1 above - there doesn't appear to be in the stm32f7/stm32_dma.c
    // code a function to "Reinitialize the DMA".
    // See nuttx/arch/arm/src/stm32f7/stm32_dma.c @657-673 for code that would
    // do the above requirement (I think).
#endif
  }

  // // End of conversion - got a value?
  if ((pendingInterrupts & ADC_SR_EOC) != 0)
  {
    syslog(1, "-- ADC ISR-End of Conversion --\n");
  }

  // Clear any interrupts
  pendingInterrupts &= ~ADC_ALL_POSSIBLE_ADC_INTERRUPTS;
  putreg32(pendingInterrupts, baseADCAddr + STM32_ADC_SR_OFFSET);

  DEBUG_SET_LOW(DEBUG_PIN_V2_D04);
  return OK;
  // END IF ADC ISR
}

//======================================================================
// Assumes ADC 1
static int adc_initialize (void)
{
  uint32_t regval;

  DEBUG_CONFIGURE_PIN(DEBUG_PIN_CCM_D00_PI9);
  DEBUG_CONFIGURE_PIN(DEBUG_PIN_CCM_D01_PH13);
  DEBUG_CONFIGURE_PIN(DEBUG_PIN_CCM_D02_PH10);
  DEBUG_CONFIGURE_PIN(DEBUG_PIN_CCM_D03_PB8);
  DEBUG_CONFIGURE_PIN(DEBUG_PIN_CCM_D04_PB9);

  // adc_test_display_basic_adc_regs(STM32_ADC1_BASE);

  // Insure the correct ADC clock is on. If not enabled it was impossible
  // to successfully write values into some ADC configuration registers.
  // (--) NEEDED ?
  regval = getreg32(STM32_RCC_APB2ENR);
  regval |= RCC_APB2ENR_ADC1EN;
  putreg32(regval, STM32_RCC_APB2ENR);

  regval = getreg32(STM32_RCC_AHB1ENR);
  regval |= RCC_AHB1ENR_DMA2EN;
  putreg32(regval, STM32_RCC_AHB1ENR);

  // Turn-off ADC
  // regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  // regval &= ~ADC_CR2_ADON;      // 0=A/D Converter off (turned on later)
  // putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  // Set the ADC watchdog high and low threshold to max and min
  putreg32(0x00000fff, STM32_ADC1_BASE + STM32_ADC_HTR_OFFSET);
  putreg32(0x00000000, STM32_ADC1_BASE + STM32_ADC_LTR_OFFSET);

  // Reset all the ADCs via Reset and Clock Control (RCC). For the STM32F7
  // there is a single bit for all ADCs. Other MCUs have a bit for each ADC.
  regval = getreg32(STM32_RCC_APB2RSTR);
  regval |= RCC_APB2RSTR_ADCRST;
  putreg32(regval, STM32_RCC_APB2RSTR);

  // // Restore ADC from reset state
  regval = getreg32(STM32_RCC_APB2RSTR);
  regval &= ~RCC_APB2RSTR_ADCRST;
  putreg32(regval, STM32_RCC_APB2RSTR);

  // Now for some ADC work
  //------------------------------------------------------------
  // ADC Common Control Register (CCR)
  regval = getreg32(STM32_ADC_CCR);
  // regval &= ~ADC_CCR_TSVREFE;       // 0=disable temperature sensor channel
  // regval &= ~ADC_CCR_VBATE;         // 0=disable vbat channel

